load-tests/basic.yml
config:
  target: http://127.0.0.1:4000
  phases:
    - duration: 5
      arrivalRate: 3
      rampTo: 1
      name: Warm up phase
    - duration: 5
      arrivalRate: 5
      rampTo: 1
      name: Ramp up load
    - duration: 10
      arrivalRate: 5
      rampTo: 2
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
          - get:
              url: "/kategori/frukt-och-gront/frukt/melon/"
          - get:
              url: "/kategori/mejeri-ost-och-agg/agg"
          - get:
              url: "/kategori/kott-chark-och-fagel/fagel"   
          - get:
              url: "/kategori/blommor-och-tradgard"
          - get:
              url: "/produkt/100651251_ST/kategori/barn/valling-och-ersattning/valling-12-man"
          - get:
              url: "/produkt/101285120_ST/kategori/djur"
          - get:
              url: "/produkt/101277014_ST/kategori/vegetariskt"   
          - get:
              url: "/produkt/101259837_ST/kategori/skafferi"  
                  
        count: 5