load-tests/shopping.yml
config:
  target: http://127.0.0.1:4000
  phases:
    #These phases are set low to not overheat our computers. 
    - duration: 2
      arrivalRate: 1
      rampTo: 1
      name: Warm up phase
    - duration: 5
      arrivalRate: 3
      rampTo: 1
      name: Ramp up load
    - duration: 5
      arrivalRate: 5
      rampTo: 1
      name: Spike phase
  engines:
    playwright: 
      launchOptions:
        headless: true
        aggregateByName: true
  processor: "./shopping.cjs"
scenarios:
  - name: Meat Shopping
    engine: playwright
    testFunction: meat
  - name: Milk Shopping
    engine: playwright
    testFunction: milk  
  - name: Deep Frozen Shopping
    engine: playwright
    testFunction: deepFrozen
  - name: Cake Shopping
    engine: playwright
    testFunction: cake
  - name: Pacifier Shopping
    engine: playwright
    testFunction: pacifier
  - name: Meat Shopping
    engine: playwright
    testFunction: meat
  - name: Lime Shopping
    engine: playwright
    testFunction: lime
  - name: icecream Shopping
    engine: playwright
    testFunction: iceCream
  - name: cleaningWipes Shopping
    engine: playwright
    testFunction: cleaningWipes
  - name: beverage Shopping
    engine: playwright
    testFunction: beverage